[{"dia_evento":"1","data":"11/11/2022\nsexta","horario":"19h","duracao":"2 horas","tipo":"Oficina","titulo":"Introdução à programação em Javascript","proponente":"Guilherme Ranoya","proponente_url":"https://twitter.com/ranoya ","descricao":"Oficina/Workshop para quem quer dar seus primeiros passos, entender os fundamentos básicos e os contextos/ambientes onde o código Javascript roda. Destinada a quem está migrando do Processing para o P5, para quem está iniciando com o P5, ou pra quem está querendo programar com Javascript puro.","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"1","data":"11/11/2022\nsexta","horario":"21h","duracao":"1 hora","tipo":"Demonstração","titulo":"Demonstração do Marcelo Prates","proponente":"Marcelo Prates","proponente_url":"https://marceloprates.github.io/","descricao":"","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"2","data":"12/11/2022\nsábado","horario":"9h","duracao":"1 hora","tipo":"Perfomance","titulo":"O Labirinto de Processing","proponente":"Guilherme Silveira","proponente_url":"https://www.instagram.com/guilherme_pessoal/","descricao":"O Labirinto de Processing é uma performance participativa semeada por arte generativa que também funciona como workshop. Utilizando conceitos de arte generativa, o artista criou inúmeros labirintos que indicam caminhos entre a pessoa participante e sua próxima obra.\n\nNo início da performance, cada participante recebe o link de um labirinto único e cria um novo sketch no p5.js. Por exemplo, se temos 20 participantes, serão 20 labirintos e cada pessoa com seu próprio sketch (20 sketches).\n\nCada passo no labirinto é o nome de uma função ou constante de p5.js. A participante deve então adicionar aquela função no seu sketch de alguma forma e avançar um passo no labirinto.\n\nO labirinto é um grid 7x7 com mais de um caminho possível para a saída. Nem todas as participantes serão capazes de chegar ao fim do labirinto, mas não há regras apresentadas de como o labirinto deve ser caminhado: assim como no mundo real, cada participante encontrará seu caminho através da api (referência) do p5.js, enquanto explora algo novo.\n\nEnquanto participantes traçam seus próprios caminhos e criam seus sketches, digitam no chat cada palavra conquistada. O artista então é responsável por - em seu próprio sketch - utilizar tal palavra.\n\nTerminamos a performance participativa com N participantes, N+1 sketches nas mais diversas explorações de nossos próprios caminhos.\n\nOs últimos 5 minutos são usados para passar pelos sketches resultantes.\n\nO labirinto funciona ao mesmo tempo como abstração e materialização do processo de criação de sketches usando Processing.","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"2","data":"12/11/2022\nsábado","horario":"10h","duracao":"2 horas","tipo":"Palestra","titulo":"Agentes Autônomos (e suas criações)","proponente":"Mateus Berruezo","proponente_url":"https://codigotranscendente.github.io/livro/","descricao":"Palestra com o objetivo de introduzir, superficialmente, o conceito de agentes autônomos (sistemas computacionais que tomam ações sem a interferência humana, de acordo com seus próprios objetivos e interações com o ambiente em que estão inseridos). A ideia também é mostrar como pequenas variações nos agentes geram visualizações e padrões amplamente distintos. ","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"2","data":"12/11/2022\nsábado","horario":"14h","duracao":"2 horas","tipo":"Oficina","titulo":"Geração de Imagens com IA: coletânea de ferramentas para experimentação","proponente":"Filipe Calegario","proponente_url":"https://github.com/filipecalegario/","descricao":"Esta oficina é um momento de experimentação com as ferramentas mais atuais de geração de imagens usando IA. É voltado para o público de artistas, designers, pessoas desenvolvedoras, entusiastas e curiosas.\n\nComeçaremos entendendo o funcionamento de alguns modelos existentes (ex: GAN, diffusion, latent diffusion), depois veremos exemplos de uso e de adaptações das ferramentas (ex: MidJourney, DALL-E 2, Stable Diffusion), além de combinações e usos criativos das técnicas associadas.\n\nConsiderando a geração de imagens baseada em textos, veremos técnicas de engenharia de prompt, ou seja, qual a melhor combinação de palavras para termos uma imagem desejada. Trabalharemos em grupos e individualmente na composição de prompts e experimentação na geração das imagens. O objetivo é termos uma galeria coletiva ao final do workshop.\n\nDepois desse momento mão-na-massa, abrimos para discutir qual o impacto que tais ferramentas podem ter no processo criativo humano e as repercussões éticas emergentes.\n\nUma pergunta que guiará o workshop é: como diminuir a distância entre tais ferramentas e os artistas, designers, pessoas desenvolvedoras, entusiastas e curiosas?","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"2","data":"12/11/2022\nsábado","horario":"16h","duracao":"1 hora","tipo":"Oficina","titulo":"Vídeo Sintetizadores - criando imagens em processing","proponente":"Rodrigo Rezende","proponente_url":"","descricao":"Nesta palestra vou mostrar como estou compilando e desenvolvendo uma parte do meu mestrado onde através da manipulação de equações crio ou altero modos e mistura de imagens, estáticas ou em movimento no Processing.\n\nPretendo demostrar alguns dos principios de manipulação de imagens analógicas e digitais e também alguns experimentos que venho realizando, através do uso do Processing e algum material de apoio.","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"2","data":"12/11/2022\nsábado","horario":"17h","duracao":"1 hora","tipo":"Conversa","titulo":"Conversas sobre Dall-e 2, Midjourney e Stable Diffusion: Impactos na Arte","proponente":"Sergio Venancio","proponente_url":"","descricao":"Dall-E 2, Midjourney e Stable Diffusion são modelos de inteligência artificial que geram imagens impressionantes a partir de comandos de texto, e se tornaram acessíveis a grandes públicos. Quais são os impactos dessas tecnologias sobre processos criativos? Quais suas vantagens e desvantagens, possibilidades e limitações? Como muda o trabalho do artista que utiliza essas tecnologias? Ou não muda? Trazemos para esta roda de conversa os artistas Vanessa Rosa e Alexandre Rangel, a cientista Leo Sampaio e o empresário e educador Guilherme Silveira, que vêm utilizando e experimentando com esses modelos, e contarão sobre suas experiências e opiniões.","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"3","data":"13/11/2022\ndomingo","horario":"9h","duracao":"1 hora","tipo":"Oficina","titulo":"Criando com palhetas de cores em p5.js","proponente":"Gustavo Mandolesi","proponente_url":"","descricao":"Apresentação de uma biblioteca de código aberto para facilitar o gerenciamento e o uso de palhetas de cores em p5.js. Um pouco de teoria sobre a aplicação de cores em programação criativa e demonstrações práticas através de exemplos.","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"3","data":"13/11/2022\ndomingo","horario":"10h","duracao":"2 horas","tipo":"Oficina","titulo":"Primeiros passos na programação criativa com Python","proponente":"Alexandre Villares","proponente_url":"https://twitter.com/villares","descricao":"Uma atividade introdutória para quem quer experimentar pela primeria vez gerar imagens com programação, usando Python.","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"3","data":"13/11/2022\ndomingo","horario":"14h","duracao":"2 horas","tipo":"Oficina","titulo":"Joguinho Arcade do Zero!","proponente":"John","proponente_url":"https://introscopia.github.io/","descricao":"Vamos retomar a tradição dos primeiros PCDs e tentar montar um joguinho (ou protótipo de jogo, ou esboço...) em apenas duas horas! Tragas os seus melhores truques e gambiarras, ou, se ainda não programa muito, traga ideias, desenhos, música, ou só entusiasmo já ta ótimo também!","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"3","data":"13/11/2022\ndomingo","horario":"16h","duracao":"1 hora","tipo":"Palestra","titulo":"Processing + Dados : entre a arte e o design","proponente":"Barbara Castro","proponente_url":"https://www.instagram.com/barbaracastro/","descricao":"Barbara Castro irá falar sobre os diferentes projetos que já realizou enquanto artista e designer usando dados com Processing. A palestra irá abordar tanto aspectos técnicos, demonstração de código, quanto questões sobre o processo de criação e experimentação envolvidos na programação criativa.","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"3","data":"13/11/2022\ndomingo","horario":"16h","duracao":"1 hora","tipo":"Oficina","titulo":"ARTE DO TEXTO - introdução a programação criativa","proponente":"Barbara Castro","proponente_url":"https://www.instagram.com/barbaracastro/","descricao":"Esta oficina será uma introdução a programação criativa com p5.js que irá focar no uso de textos - ou strings. Vamos nos inspirar em exemplos da poesia concreta de Augusto de Campos para entender como processar e representar strings. Vamos abordar a iteração (for) e o uso de listas (arrays), além de funções específicas para processamento de variáveis de texto.","requisitos":"","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"},{"dia_evento":"4","data":"12/11 e 13/11","horario":"19h","duracao":"2 encontros de 3 horas","tipo":"Oficina","titulo":"Uma introdução à programação criativa com uma introdução à caligrafia e vice-versa","proponente":"Mariana Leal","proponente_url":"https://www.instagram.com/amaolevissima/","descricao":"Esta proposta visa oferecer uma oficina de introdução à programação criativa por meio de uma introdução à caligrafia e vice-versa. Aprenderemos a programar programando a nossa primeira pena de ponta reta. Além disso, aprenderemos como inserir pautas dentro do nosso sketch para que possamos praticar caligrafia dentro do processing, sem sair do computador. \n\nA oficina precisará de dois dias para acontecer satisfatoriamente. Um dia para programação, outro dia para prática caligráfica. Ensinarei o alfabeto fundamental letra por letra, e depois haverá tempo para muita prática e esclarecimento de dúvidas.","requisitos":"No segundo dia será necessário ter em mãos algum tipo de mesa de digitalização (Wacom, Cintiq, Multilaser etc.)","url_calendario":"","url_video_conferencia":"","evento_ativo":"sim"}]